In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [32]:
MySeries = ['Faisal','Mohammed','Ali']
p= pd.Series(MySeries)
p

0      Faisal
1    Mohammed
2         Ali
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [33]:
MySeries = ['Faisal','Mohammed','Ali']
p= pd.Series(MySeries, index=[11,12,13])
p

11      Faisal
12    Mohammed
13         Ali
dtype: object

## Q3: Retrieve First and second elements.

In [34]:
MySeries = ['Faisal','Mohammed','Ali']
p= MySeries[0:2]
p

['Faisal', 'Mohammed']

## Q4: Add duplicate elements, then remove the duplication

In [50]:

s = ['Mohammed']
s2 = MySeries.append(s)
MySeries

['Faisal',
 'Mohammed',
 'Ali',
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed'],
 ['Mohammed']]

In [51]:
s2.drop_duplicates()
MySeries

AttributeError: 'NoneType' object has no attribute 'drop_duplicates'

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [18]:
 Students = {'ID':[],'Name':[],'University':[]}
    
df = pd.DataFrame(Students)

df

Empty DataFrame
Columns: [ID, Name, University]
Index: []

## Q6: Read educ_figdp_1_Data.csv file

In [54]:
edu = pd.read_csv('/Users/Faisal/Desktop/labday7/Day7-Lab1-Pandas/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references